import scss from './DeliveryPage.module.scss';
import Footer from "components/Footer/Footer";
import {FaTruck} from "react-icons/fa";
// import {HiOutlineOfficeBuilding} from "react-icons/hi"

const DeliveryPage = () => {

  return (
    <>
      <div className={scss.container}>
        <div className={scss.part}>
              <h2 className={scss.title}>Замовлення</h2>
              <p>Товар доставляється протягом 1-3 робочих днів з моменту надходження замовлення. При безготівковій оплаті – протягом 1-3 робочих днів з моменту надходження коштів на наш рахунок.Термін доставки замовлених позицій обговорюється з менеджерами окремо.</p>
              <p className={scss.sentences}>Замовлення, оформлені до 12:00, доставляються по Києву на наступний робочий день, по Україні – 24-72 години в залежності від регіону, в який відправляється товар. Документи, що підтверджують факт купівлі товару, направляються разом з товаром.</p>
              <ol className={scss.list}>Доставка товарів здійснюється:
                <li className={scss.list_item}>Самовивіз в Києві зі складу компанії ${}.</li>
                <li className={scss.list_item}>По Україні поштовою компанією «Нова пошта»:
                  <ul> 
                    <li className={scss.list_item}>доставка в відділення перевізника «Нова пошта». Актуальний перелік центрів видачі посилок і графік їх роботи, умови і графік кур'єрської доставки представлені на офіційному сайті перевізника</li>
                    <li className={scss.list_item}>адресна доставка по Україні - згідно з діючими тарифами перевізника, може бути узгоджена індивідуально.</li>
                  </ul>
                </li>
              </ol>
              <p className={scss.sentences}>У разі неотримання замовлення протягом 4-х днів після доставки на відділення «Нової пошти», товар повертається відправнику, а замовлення анулюється.</p>
        </div>
          <div className={scss.part}>
            <div>
              <FaTruck/>
              <h2 className={scss.title}>Доставка</h2>
            </div>

            <ol>
              <li>Нова Пошта (включаючи накладений платіж)</li>
              <li>Самовивіз зі складу в місті Києві</li>
              <li>Делівері (без можливості доставки з післяплатою)</li>
              <li>Доставка автомобілем по місту Києву (при замовленні від 400 кг)</li>
            </ol>
          </div>

          <div className={scss.part}>
            <h2 className={scss.title}>Повернення товару</h2>
            <p className={scss.sentences}>Товар, придбаний в інтернет-магазині COLOR-FARB.ua можна обміняти (повернути) протягом 14 днів з моменту покупки, згідно з Законом України "Про захист прав споживача".</p>
            <p className={scss.sentences}>До повернення приймається товар належної якості, який не використовувався, збережені: товарний вигляд товару, його споживчі властивості, пломби. Доставка за повернення товару оплачується покупцем.  Повернення грошей здійснюється протягом 3-х днів з моменту отримання товару.</p>
            <p className={scss.sentences}>Нестандартний товар, що був виготовлений за індивідуальним замовленням Покупця, наприклад, тонована фарба, не підлягає поверненню.</p>
          </div>
          <div className={scss.container}>
            <h1 className={scss.title_main}>Оплата</h1>
            <p className={scss.sentences}>Оплатити замовлення можна  безготівковим платежем на сайті Інтернет-магазину COLOR-FARB.ua.</p>
            <h2 className={scss.title}>Безготівковий розрахунок</h2>
            <p className={scss.sentences}>Оплата за безготівковим розрахунком доступна для юридичних осіб. Для підтвердження замовлення покупцеві електронним листом направляється рахунок-фактура на оплату.</p>
            <p className={scss.sentences}>Для оформлення рахунку-фактури для юридичних осіб потрібне надання сканованої копії реєстраційних документів (коду ЄДРПОУ та свідоцтва платника ПДВ), які необхідно відправити електронною поштою на адресу color-farb@gmail.com.</p>
          </div>
      </div>
      <Footer/>
    </>
  );
};

export default DeliveryPage;