import scss from './CompanyPage.module.scss';
import Footer from "components/Footer/Footer";

const CompanyPage = () => {

    return (
      <>
        <div className={scss.container}>
          <h1 className={scss.title}>Про компанію</h1>
          <p className={scss.sentences}>«ТОВ ВКФ Колор-Фарб» виробляє та реалізує лакофарбові матеріали з 1995 року  згідно з європейськими стандартами якості. З перших днів компанія орієнтується на створення структури, здатної забезпечити кожному споживачеві індивідуальне технічне рішення з використанням високоякісних матеріалів. Це дає ефективний сервіс та максимальні зручності у процесі спільної роботи.</p>
          <p className={scss.sentences}>Багатий інноваційний підхід, суворий контроль якості та післяпродажна підтримка компанії є визначними у просуванні своєї продукції на сучасному ринку.</p>
          <p className={scss.sentences}>«ТОВ ВКФ Колор-Фарб» пропонує лакофарбові матеріали для антикорозійного захисту та промисловості, залізничного рухомого складу, малої авіації, мостів, авто- та суднобудування тощо.</p>
          <p className={scss.sentences}>Вся продукція підприємства «ТОВ ВКФ Колор-Фарб» виготовлена згідно з  стандартом ТУ, гарантує та забезпечує високу якість лакофарбових матеріалів.</p>
        </div>
        <Footer/>
      </>
    );
  };
  
  export default CompanyPage;